In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
# Series可以看作一维数组和字典的结合
s=Series([1,2,3,4],index=['a','b','c','d'])
# s=Series(dict)生成的Series按索引（字典键）排序好，index=list索引则可不排序
# 索引可通过s.index=list改变
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s['a']

1

In [5]:
# +操作类似于join
s2=Series([3,2,3,4],index=['e','b','c','d'])
s2

e    3
b    2
c    3
d    4
dtype: int64

In [6]:
s1=s+s2
s1

a    NaN
b    4.0
c    6.0
d    8.0
e    NaN
dtype: float64

In [7]:
pd.isnull(s1)
# pd.notnull和isnull()检查是否有空值

a     True
b    False
c    False
d    False
e     True
dtype: bool

In [8]:
# DataFrame可看作Serise的字典
data={'a':[1,2,3,4],'b':[7,8,9,10],'c':[11,12,13,14]}
frame=DataFrame(data)
frame

   a   b   c
0  1   7  11
1  2   8  12
2  3   9  13
3  4  10  14

In [9]:
# frame.head()默认前5行

In [10]:
frame2=DataFrame(data,index=['one','two','three','four'],columns=['a','b','e','d','f'])
# data为dict，如果上传的columns不在dict中，为null
frame2

       a   b    e    d    f
one    1   7  NaN  NaN  NaN
two    2   8  NaN  NaN  NaN
three  3   9  NaN  NaN  NaN
four   4  10  NaN  NaN  NaN

In [11]:
frame2.columns=['e','f','g','h','i']
# 但可以通过.columns=list修改列名
# 参数DF（columns）为上传名，或者是上传dict中的哪些列
frame2

       e   f    g    h    i
one    1   7  NaN  NaN  NaN
two    2   8  NaN  NaN  NaN
three  3   9  NaN  NaN  NaN
four   4  10  NaN  NaN  NaN

In [12]:
frame2['e']
# 选择列
frame2.e
# 可用tab补全
# 索引更常用.loc

one      1
two      2
three    3
four     4
Name: e, dtype: int64

In [13]:
val=Series([3,1],index=['one','three'])
frame2['j']=val
frame2
# Serise根据索引给值

       e   f    g    h    i    j
one    1   7  NaN  NaN  NaN  3.0
two    2   8  NaN  NaN  NaN  NaN
three  3   9  NaN  NaN  NaN  1.0
four   4  10  NaN  NaN  NaN  NaN

In [14]:
# 通过del删列
del frame2['i']
frame2

       e   f    g    h    j
one    1   7  NaN  NaN  3.0
two    2   8  NaN  NaN  NaN
three  3   9  NaN  NaN  1.0
four   4  10  NaN  NaN  NaN

In [15]:
# 从DataFrame选取的也是视图，拷贝通过copy（）

In [16]:
# 可通过.T对DF转置
frame2.T

   one  two three four
e    1    2     3    4
f    7    8     9   10
g  NaN  NaN   NaN  NaN
h  NaN  NaN   NaN  NaN
j    3  NaN     1  NaN

In [17]:
# 可以通过name给DF，S，索引，列起名

In [18]:
# 通过.values返回ndarray
frame2.values

array([[1, 7, nan, nan, 3.0],
       [2, 8, nan, nan, nan],
       [3, 9, nan, nan, 1.0],
       [4, 10, nan, nan, nan]], dtype=object)

In [19]:
frame2.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [20]:
# 通过.reindex(list)选择行列
states=['f','w','e','r','j']
frame2.reindex(range(6),columns=states,fill_value=0)
# 本质还是按索引，列名选择，而不是改变索引、列的名称
# 相当于loc[]进行行列选择

   f  w  e  r    j
0  0  0  0  0  0.0
1  0  0  0  0  0.0
2  0  0  0  0  0.0
3  0  0  0  0  0.0
4  0  0  0  0  0.0
5  0  0  0  0  0.0

In [21]:
# 可通过drop（list，axis=）删除list指定的行列

In [22]:
# Serise的索引是闭区间S['a':'c']=s[['a','b','c']]
# 对其进行修改会写到原文件上

In [23]:
frame2['e']
# 文字，列

one      1
two      2
three    3
four     4
Name: e, dtype: int64

In [24]:
frame2[:2]
# 数字，行

     e  f    g    h    j
one  1  7  NaN  NaN  3.0
two  2  8  NaN  NaN  NaN

In [25]:
frame2>3

           e     f      g      h      j
one    False  True  False  False  False
two    False  True  False  False  False
three  False  True  False  False  False
four    True  True  False  False  False

In [26]:
# loc基于标签的索引，iloc基于整数的索引
# loc[行，列]，iloc[行，列]
# loc[:1] 0,1 iloc[:1] 0 data[:1] 0
frame2.iloc[0,[0,2]]

e      1
g    NaN
Name: one, dtype: object

In [27]:
frame2.loc['one':,['e','g']]

       e    g
one    1  NaN
two    2  NaN
three  3  NaN
four   4  NaN

In [28]:
# pandas对象相加相对于外连接，没有对应索引为null
frame2.loc[:'three','e']

one      1
two      2
three    3
Name: e, dtype: int64

In [29]:
frame2.loc['two':,'f']

two       8
three     9
four     10
Name: f, dtype: int64

In [30]:
frame2.loc[:'three','e']+frame2.loc['two':,'f']

four      NaN
one       NaN
three    12.0
two      10.0
dtype: float64

In [31]:
frame2.loc[:'three','e'].add(frame2.loc['two':,'f'],fill_value=0)
# 可以调用内部add方法

four     10.0
one       1.0
three    12.0
two      10.0
dtype: float64

In [32]:
# DF和S数学操作有广播机制，对每个行/列进行操作，axis选择匹配轴

In [33]:
# np的通用函数也可用于pd,np.abs(frame)
# f=lambda 也可使用.apply(f)调用函数
f=lambda x:x+1
frame2['e'].apply(f)
# 也可在apply(axis=指明坐标轴)
# 也可以用S.map(f)或DF.applymap(f)逐个元素用

one      2
two      3
three    4
four     5
Name: e, dtype: int64

In [34]:
# 可以使用sort_index(axis=0,ascending=False)对索引进行排序
frame2.sort_index(axis=0,ascending=False)
# 对行索引排列

       e   f    g    h    j
two    2   8  NaN  NaN  NaN
three  3   9  NaN  NaN  1.0
one    1   7  NaN  NaN  3.0
four   4  10  NaN  NaN  NaN

In [35]:
# 按值可以使用frame2['e'].sort_values()按值排序
frame2['e'].sort_values()
# frame.sort_values(by=list)指定按列排列

one      1
two      2
three    3
four     4
Name: e, dtype: int64

In [36]:
# 如果索引存在重复，则索引可能返回DF或S

In [37]:
# df.sort(axis=1，skipna=False)按行对各列值相加,不跳过null
frame2.describe()
# 产生多个统计信息
# quantile（） 01之间分位数

              e          f         j
count  4.000000   4.000000  2.000000
mean   2.500000   8.500000  2.000000
std    1.290994   1.290994  1.414214
min    1.000000   7.000000  1.000000
25%    1.750000   7.750000  1.500000
50%    2.500000   8.500000  2.000000
75%    3.250000   9.250000  2.500000
max    4.000000  10.000000  3.000000

In [38]:
# S1.corr(S2)相关性
# S2.cov(S2)协方差
frame2.corr()

     e    f    j
e  1.0  1.0 -1.0
f  1.0  1.0 -1.0
j -1.0 -1.0  1.0

In [39]:
frame2.cov()

          e         f    j
e  1.666667  1.666667 -2.0
f  1.666667  1.666667 -2.0
j -2.000000 -2.000000  2.0

In [40]:
# frame.corrwith(S/F)与另一F/S的相关性

In [41]:
# unique（）返回唯一的值
# uniques.sort()唯一并排序
# value_count()返回值个数
# isin（list）各元素是否在list中
# match(list)计算每个值整数索引，形成唯一值数组